def triangle_area(a, h): 
    #возвращает площадь треугольника
    # Параметры:
    # а: длина стороны
    # h: высота треугольника
    # Возвращаемое значение:
    # число, являющееся произведением числа а на h и разделенное на 2.
    return a * h / 2 

def triangle_perimeter(a, b, c): 
    #возвращает площадь треугольника
    # Параметры:
    # а: длина стороны
    # b: длина второй стороны
    # c:длина гипотенузы
    # Возвращаемое значение:
    # число, являющееся сложением чисел а b и c.
    return a + b + c 